DELETE FROM `students`;
ALTER TABLE `students` AUTO_INCREMENT = 0;

DELETE FROM `classes`;
ALTER TABLE `classes` AUTO_INCREMENT = 0;

DELETE FROM `teachers`;
ALTER TABLE `teachers` AUTO_INCREMENT = 0;

DELETE FROM `subjects`;
ALTER TABLE `subjects` AUTO_INCREMENT = 0;

DELETE FROM `marks`;
ALTER TABLE `marks` AUTO_INCREMENT = 0;

DELETE FROM `parents`;
ALTER TABLE `parents` AUTO_INCREMENT = 0;

INSERT INTO `subjects` (`subject_name`) VALUES 
('algebra'),
('physics'),
('chemistry'),
('history'),
('biology'),
('english'),
('astronomy'),
('geometry'),
('physical Culture'),
('geography');

INSERT INTO `teachers` (`first_name`, `last_name`, `patronymic`, `subject_id`) VALUES 
('Кулагин', 'Олег', 'Андреевич', '1'),
('Костромитин', 'Тимофей', 'Ильич', '2'),
('Костенкова', 'Анна', 'Михайловна', '3'),
('Колчанова', 'Ольга', 'Викторовна', '4'),
('Кожемяко', 'Сергей', 'Александрович', '5'),
('Иванова', 'Дарья', 'Александровна', '6'),
('Драчев', 'Антон', 'Евгеньевич', '7'),
('Грушко', 'Константин', 'Сергеевич', '8'),
('Веснин', 'Юрий', 'Александрович', '9'),
('Васюков', 'Роман', 'Владимирович', '10');

INSERT INTO `classes` (`number`, `character`) VALUES
('8', 'A'),
('8', 'A'),
('8', 'B'),
('8', 'B'),
('9', 'A'),
('9', 'C'),
('9', 'C'),
('9', 'C'),
('10', 'D'),
('10', 'D');

INSERT INTO `students` (`last_name`, `first_name`, `patronymic`, `class_id`, `street`, `house_number`, `flat_number`) VALUES
('Куликов', 'Роман', 'Александрович', '1', 'Some street one', '10', '110'),
('Лимаренко', 'Дмитрий', 'Геннадьевич', '2', 'Some street two', '20', '120'),
('Макаров', 'Денис', 'Андреевич', '3', 'Some street three', '30', '130'),
('Нестеров', 'Никита', 'Алексеевич', '4', 'Some street four', '40', '140'),
('Николашкин', 'Виталий', 'Анатольевич', '5', 'Some street five', '50', '150'),
('Олейник', 'Янина', 'Олеговна', '6', 'Some street six', '60', '160'),
('Осипов', 'Никита', 'Андреевич', '7', 'Some street seven', '70', '170'),
('Ровкова', 'Алеся', 'Сергеевна', '8', 'Some street eight', '80', '180'),
('Свиридова', 'Анна', 'Андреевна', '9', 'Some street nine', '90', '190'),
('Семенова', 'Татьяна', 'Дмитриевна', '10', 'Some street ten', '99', '199');

INSERT INTO `parents` (`student_id`, `last_name`, `first_name`, `patronymic`) VALUES 
('1', 'Алмасов', 'Эдгар', 'Фатуллаевич'),
('2', 'Баранова', 'Ксения', 'Александровна'),
('3', 'Головчанская', 'Анна', 'Игоревна'),
('4', 'Зайцев', 'Ярослав', 'Викторович'),
('5', 'Лачина', 'Кристина', 'Александровна'),
('6', 'Лебедева', 'Александра', 'Игоревна'),
('7', 'Мульманова', 'Виктория', 'Алексеевна'),
('8', 'Петров', 'Александр', 'Алексеевич'),
('9', 'Петрова', 'Алена', 'Юрьевна'),
('10', 'Полина', 'Екатерина', 'Александровна');

INSERT INTO `marks` (`student_id`, `mark`, `subject_id`, `date`) VALUES 
('1', '7', '10', '2021-10-01'),
('1', '6', '10', '2021-10-01'),
('2', '8', '9', '2021-10-02'),
('2', '5', '9', '2021-10-02'),
('3', '7', '8', '2021-10-03'),
('3', '9', '8', '2021-10-04'),
('4', '6', '7', '2021-10-03'),
('4', '8', '7', '2021-10-04'),
('5', '9', '6', '2021-10-05'),
('5', '5', '6', '2021-10-05'),
('6', '7', '5', '2021-10-06'),
('6', '8', '5', '2021-10-06'),
('7', '6', '4', '2021-10-07'),
('7', '9', '4', '2021-10-07'),
('8', '5', '3', '2021-10-08'),
('8', '7', '3', '2021-10-08'),
('9', '4', '2', '2021-10-09'),
('9', '6', '2', '2021-10-09'),
('10', '9', '1', '2021-10-10'),
('10', '8', '1', '2021-10-11');